gsoap-2.8/gsoap/james/analytics.2.0.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2008-2010 by ONVIF: Open Network Video Interface Forum. All rights reserved.

Recipients of this document may copy, distribute, publish, or display this document so long as this copyright notice, license and disclaimer are retained with all copies of the document. No license is granted to modify this document.

THIS DOCUMENT IS PROVIDED "AS IS," AND THE CORPORATION AND ITS MEMBERS AND THEIR AFFILIATES, MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR TITLE; THAT THE CONTENTS OF THIS DOCUMENT ARE SUITABLE FOR ANY PURPOSE; OR THAT THE IMPLEMENTATION OF SUCH CONTENTS WILL NOT INFRINGE ANY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.
IN NO EVENT WILL THE CORPORATION OR ITS MEMBERS OR THEIR AFFILIATES BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, PUNITIVE OR CONSEQUENTIAL DAMAGES, ARISING OUT OF OR RELATING TO ANY USE OR DISTRIBUTION OF THIS DOCUMENT, WHETHER OR NOT (1) THE CORPORATION, MEMBERS OR THEIR AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, OR (2) SUCH DAMAGES WERE REASONABLY FORESEEABLE, AND ARISING OUT OF OR RELATING TO ANY USE OR DISTRIBUTION OF THIS DOCUMENT.  THE FOREGOING DISCLAIMER AND LIMITATION ON LIABILITY DO NOT APPLY TO, INVALIDATE, OR LIMIT REPRESENTATIONS AND WARRANTIES MADE BY THE MEMBERS AND THEIR RESPECTIVE AFFILIATES TO THE CORPORATION AND OTHER MEMBERS IN CERTAIN WRITTEN POLICIES OF THE CORPORATION.
-->
<wsdl:definitions xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.onvif.org/ver20/analytics/wsdl">
	<wsdl:types>
		<xs:schema targetNamespace="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema" elementFormDefault="qualified">
			<xs:import namespace="http://www.onvif.org/ver10/schema" schemaLocation="http://www.onvif.org/onvif/ver10/schema/onvif.xsd"/>
			<!--  Message Request/Responses elements  -->
			<!--===============================-->
			<xs:element name="GetSupportedRules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="GetSupportedRulesResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="SupportedRules" type="tt:SupportedRules"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<!--===============================-->
			<xs:element name="CreateRules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
						<xs:element name="Rule" type="tt:Config" minOccurs="1" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="CreateRulesResponse">
				<xs:complexType/>
			</xs:element>
			<!--===============================-->
			<xs:element name="DeleteRules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
						<xs:element name="RuleName" type="xs:string" minOccurs="1" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="DeleteRulesResponse">
				<xs:complexType/>
			</xs:element>
			<!--===============================-->
			<xs:element name="ModifyRules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
						<xs:element name="Rule" type="tt:Config" minOccurs="1" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="ModifyRulesResponse">
				<xs:complexType/>
			</xs:element>
			<!--===============================-->
			<xs:element name="GetRules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="GetRulesResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="Rule" type="tt:Config" minOccurs="0" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<!--===============================-->
			<xs:element name="GetSupportedAnalyticsModules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="GetSupportedAnalyticsModulesResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="SupportedAnalyticsModules" type="tt:SupportedAnalyticsModules"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<!--===============================-->
			<xs:element name="CreateAnalyticsModules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
						<xs:element name="AnalyticsModule" type="tt:Config" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="CreateAnalyticsModulesResponse">
				<xs:complexType/>
			</xs:element>
			<!--===============================-->
			<xs:element name="DeleteAnalyticsModules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
						<xs:element name="AnalyticsModuleName" type="xs:string" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="DeleteAnalyticsModulesResponse">
				<xs:complexType/>
			</xs:element>
			<!--===============================-->
			<xs:element name="ModifyAnalyticsModules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
						<xs:element name="AnalyticsModule" type="tt:Config" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="ModifyAnalyticsModulesResponse">
				<xs:complexType/>
			</xs:element>
			<!--===============================-->
			<xs:element name="GetAnalyticsModules">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="ConfigurationToken" type="tt:ReferenceToken"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="GetAnalyticsModulesResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element name="AnalyticsModule" type="tt:Config" minOccurs="0" maxOccurs="unbounded"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<!--===============================-->
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="GetSupportedRulesRequest">
		<wsdl:part name="parameters" element="tan:GetSupportedRules"/>
	</wsdl:message>
	<wsdl:message name="GetSupportedRulesResponse">
		<wsdl:part name="parameters" element="tan:GetSupportedRulesResponse"/>
	</wsdl:message>
	<wsdl:message name="CreateRulesRequest">
		<wsdl:part name="parameters" element="tan:CreateRules"/>
	</wsdl:message>
	<wsdl:message name="CreateRulesResponse">
		<wsdl:part name="parameters" element="tan:CreateRulesResponse"/>
	</wsdl:message>
	<wsdl:message name="DeleteRulesRequest">
		<wsdl:part name="parameters" element="tan:DeleteRules"/>
	</wsdl:message>
	<wsdl:message name="DeleteRulesResponse">
		<wsdl:part name="parameters" element="tan:DeleteRulesResponse"/>
	</wsdl:message>
	<wsdl:message name="GetRulesRequest">
		<wsdl:part name="parameters" element="tan:GetRules"/>
	</wsdl:message>
	<wsdl:message name="GetRulesResponse">
		<wsdl:part name="parameters" element="tan:GetRulesResponse"/>
	</wsdl:message>
	<wsdl:message name="GetSupportedAnalyticsModulesResponse">
		<wsdl:part name="parameters" element="tan:GetSupportedAnalyticsModulesResponse"/>
	</wsdl:message>
	<wsdl:message name="GetSupportedAnalyticsModulesRequest">
		<wsdl:part name="parameters" element="tan:GetSupportedAnalyticsModules"/>
	</wsdl:message>
	<wsdl:message name="CreateAnalyticsModulesRequest">
		<wsdl:part name="parameters" element="tan:CreateAnalyticsModules"/>
	</wsdl:message>
	<wsdl:message name="CreateAnalyticsModulesResponse">
		<wsdl:part name="parameters" element="tan:CreateAnalyticsModulesResponse"/>
	</wsdl:message>
	<wsdl:message name="DeleteAnalyticsModulesRequest">
		<wsdl:part name="parameters" element="tan:DeleteAnalyticsModules"/>
	</wsdl:message>
	<wsdl:message name="DeleteAnalyticsModulesResponse">
		<wsdl:part name="parameters" element="tan:DeleteAnalyticsModulesResponse"/>
	</wsdl:message>
	<wsdl:message name="GetAnalyticsModulesRequest">
		<wsdl:part name="parameters" element="tan:GetAnalyticsModules"/>
	</wsdl:message>
	<wsdl:message name="GetAnalyticsModulesResponse">
		<wsdl:part name="parameters" element="tan:GetAnalyticsModulesResponse"/>
	</wsdl:message>
	<wsdl:message name="ModifyRulesRequest">
		<wsdl:part name="parameters" element="tan:ModifyRules"/>
	</wsdl:message>
	<wsdl:message name="ModifyRulesResponse">
		<wsdl:part name="parameters" element="tan:ModifyRulesResponse"/>
	</wsdl:message>
	<wsdl:message name="ModifyAnalyticsModulesRequest">
		<wsdl:part name="parameters" element="tan:ModifyAnalyticsModules"/>
	</wsdl:message>
	<wsdl:message name="ModifyAnalyticsModulesResponse">
		<wsdl:part name="parameters" element="tan:ModifyAnalyticsModulesResponse"/>
	</wsdl:message>
	<wsdl:portType name="RuleEnginePort">
		<wsdl:operation name="GetSupportedRules">
			<wsdl:input message="tan:GetSupportedRulesRequest"/>
			<wsdl:output message="tan:GetSupportedRulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="CreateRules">
			<wsdl:input message="tan:CreateRulesRequest"/>
			<wsdl:output message="tan:CreateRulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="DeleteRules">
			<wsdl:input message="tan:DeleteRulesRequest"/>
			<wsdl:output message="tan:DeleteRulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="GetRules">
			<wsdl:input message="tan:GetRulesRequest"/>
			<wsdl:output message="tan:GetRulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="ModifyRules">
			<wsdl:input message="tan:ModifyRulesRequest"/>
			<wsdl:output message="tan:ModifyRulesResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:portType name="AnalyticsEnginePort">
		<wsdl:operation name="GetSupportedAnalyticsModules">
			<wsdl:input message="tan:GetSupportedAnalyticsModulesRequest"/>
			<wsdl:output message="tan:GetSupportedAnalyticsModulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="CreateAnalyticsModules">
			<wsdl:input message="tan:CreateAnalyticsModulesRequest"/>
			<wsdl:output message="tan:CreateAnalyticsModulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="DeleteAnalyticsModules">
			<wsdl:input message="tan:DeleteAnalyticsModulesRequest"/>
			<wsdl:output message="tan:DeleteAnalyticsModulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="GetAnalyticsModules">
			<wsdl:input message="tan:GetAnalyticsModulesRequest"/>
			<wsdl:output message="tan:GetAnalyticsModulesResponse"/>
		</wsdl:operation>
		<wsdl:operation name="ModifyAnalyticsModules">
			<wsdl:input message="tan:ModifyAnalyticsModulesRequest"/>
			<wsdl:output message="tan:ModifyAnalyticsModulesResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="RuleEngineBinding" type="tan:RuleEnginePort">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="GetSupportedRules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/GetSupportedRules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="CreateRules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/CreateRules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="DeleteRules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/DeleteRules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="GetRules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/GetRules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="ModifyRules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/ModifyRules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:binding name="AnalyticsEngineBinding" type="tan:AnalyticsEnginePort">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="GetSupportedAnalyticsModules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/GetSupportedAnalyticsModules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="CreateAnalyticsModules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/CreateAnalyticsModules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="DeleteAnalyticsModules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/DeleteAnalyticsModules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="GetAnalyticsModules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/GetAnalyticsModules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="ModifyAnalyticsModules">
			<soap:operation soapAction="http://www.onvif.org/ver20/analytics/wsdl/ModifyAnalyticsModules"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
</wsdl:definitions>
