test/fixtures/vcr_cassettes/get_analytics_modules.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n    <SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://www.w3.org/2003/05/soap-envelope\"\n    xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\n    xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis=200401-wss-wssecurity-utility-1.0.xsd\">\n    <SOAP-ENV:Header><wsse:Security><wsse:UsernameToken>\n    <wsse:Username>admin</wsse:Username>\n    <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest\">aE8KIK30cVk0pSO9pU88pbVAtIA=</wsse:Password>\n    <wsse:Nonce>wr3DnHfCmnbCpcOHwok6wpHCmQF/P8ONe8OQDMKEwqfCvw==</wsse:Nonce>\n    <wsu:Created>2016-02-23T23:38:54Z</wsu:Created></wsse:UsernameToken>\n    </wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body>\n    <tan:GetAnalyticsModules xmlns:tan=\"http://www.onvif.org/ver20/analytics/wsdl\"><ConfigurationToken>VideoAnalyticsToken</ConfigurationToken></tan:GetAnalyticsModules>\n    </SOAP-ENV:Body></SOAP-ENV:Envelope>",
      "headers": {
        "Content-Type": "application/soap+xml",
        "SOAPAction": "http://www.w3.org/2003/05/soap-envelope"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://recorded_response/onvif/Analytics"
    },
    "response": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\r\n<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:soapenc=\"http://www.w3.org/2003/05/soap-encoding\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:tt=\"http://www.onvif.org/ver10/schema\" xmlns:tds=\"http://www.onvif.org/ver10/device/wsdl\" xmlns:trt=\"http://www.onvif.org/ver10/media/wsdl\" xmlns:timg=\"http://www.onvif.org/ver20/imaging/wsdl\" xmlns:tev=\"http://www.onvif.org/ver10/events/wsdl\" xmlns:tptz=\"http://www.onvif.org/ver20/ptz/wsdl\" xmlns:tan=\"http://www.onvif.org/ver20/analytics/wsdl\" xmlns:tst=\"http://www.onvif.org/ver10/storage/wsdl\" xmlns:ter=\"http://www.onvif.org/ver10/error\" xmlns:dn=\"http://www.onvif.org/ver10/network/wsdl\" xmlns:tns1=\"http://www.onvif.org/ver10/topics\" xmlns:tmd=\"http://www.onvif.org/ver10/deviceIO/wsdl\" xmlns:wsdl=\"http://schemas.xmlsoap.org/wsdl\" xmlns:wsoap12=\"http://schemas.xmlsoap.org/wsdl/soap12\" xmlns:http=\"http://schemas.xmlsoap.org/wsdl/http\" xmlns:d=\"http://schemas.xmlsoap.org/ws/2005/04/discovery\" xmlns:wsadis=\"http://schemas.xmlsoap.org/ws/2004/08/addressing\" xmlns:wsnt=\"http://docs.oasis-open.org/wsn/b-2\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:wstop=\"http://docs.oasis-open.org/wsn/t-1\" xmlns:wsrf-bf=\"http://docs.oasis-open.org/wsrf/bf-2\" xmlns:wsntw=\"http://docs.oasis-open.org/wsn/bw-2\" xmlns:wsrf-rw=\"http://docs.oasis-open.org/wsrf/rw-2\" xmlns:wsaw=\"http://www.w3.org/2006/05/addressing/wsdl\" xmlns:wsrf-r=\"http://docs.oasis-open.org/wsrf/r-2\" xmlns:trc=\"http://www.onvif.org/ver10/recording/wsdl\" xmlns:tse=\"http://www.onvif.org/ver10/search/wsdl\" xmlns:trp=\"http://www.onvif.org/ver10/replay/wsdl\" xmlns:tnshik=\"http://www.hikvision.com/2011/event/topics\" xmlns:hikwsd=\"http://www.onvifext.com/onvif/ext/ver10/wsdl\" xmlns:hikxsd=\"http://www.onvifext.com/onvif/ext/ver10/schema\"><env:Body><tan:GetAnalyticsModulesResponse><tan:AnalyticsModule Name=\"MyCellMotionModule\" Type=\"tt:CellMotionEngine\"><tt:Parameters><tt:SimpleItem Name=\"Sensitivity\" Value=\"0\"/>\r\n<tt:ElementItem Name=\"Layout\"><tt:CellLayout Columns=\"22\" Rows=\"18\"><tt:Transformation><tt:Translate x=\"-1.000000\" y=\"-1.000000\"/>\r\n<tt:Scale x=\"0.090909\" y=\"0.111111\"/>\r\n</tt:Transformation>\r\n</tt:CellLayout>\r\n</tt:ElementItem>\r\n</tt:Parameters>\r\n</tan:AnalyticsModule>\r\n<tan:AnalyticsModule Name=\"MyLineDetectorModule\" Type=\"tt:LineDetectorEngine\"><tt:Parameters><tt:SimpleItem Name=\"Sensitivity\" Value=\"50\"/>\r\n<tt:ElementItem Name=\"Layout\"><tt:Transformation><tt:Translate x=\"-1.000000\" y=\"-1.000000\"/>\r\n<tt:Scale x=\"0.002000\" y=\"0.002000\"/>\r\n</tt:Transformation>\r\n</tt:ElementItem>\r\n<tt:ElementItem Name=\"Field\"><tt:PolygonConfiguration><tt:Polygon><tt:Point x=\"0\" y=\"0\"/>\r\n<tt:Point x=\"0\" y=\"1000\"/>\r\n<tt:Point x=\"1000\" y=\"1000\"/>\r\n<tt:Point x=\"1000\" y=\"0\"/>\r\n</tt:Polygon>\r\n</tt:PolygonConfiguration>\r\n</tt:ElementItem>\r\n</tt:Parameters>\r\n</tan:AnalyticsModule>\r\n<tan:AnalyticsModule Name=\"MyFieldDetectorModule\" Type=\"tt:FieldDetectorEngine\"><tt:Parameters><tt:SimpleItem Name=\"Sensitivity\" Value=\"50\"/>\r\n<tt:ElementItem Name=\"Layout\"><tt:Transformation><tt:Translate x=\"-1.000000\" y=\"-1.000000\"/>\r\n<tt:Scale x=\"0.002000\" y=\"0.002000\"/>\r\n</tt:Transformation>\r\n</tt:ElementItem>\r\n<tt:ElementItem Name=\"Field\"><tt:PolygonConfiguration><tt:Polygon><tt:Point x=\"0\" y=\"0\"/>\r\n<tt:Point x=\"0\" y=\"1000\"/>\r\n<tt:Point x=\"1000\" y=\"1000\"/>\r\n<tt:Point x=\"1000\" y=\"0\"/>\r\n</tt:Polygon>\r\n</tt:PolygonConfiguration>\r\n</tt:ElementItem>\r\n</tt:Parameters>\r\n</tan:AnalyticsModule>\r\n<tan:AnalyticsModule Name=\"MyTamperDetecModule\" Type=\"hikxsd:TamperEngine\"><tt:Parameters><tt:SimpleItem Name=\"Sensitivity\" Value=\"0\"/>\r\n<tt:ElementItem Name=\"Transformation\"><tt:Transformation><tt:Translate x=\"-1.000000\" y=\"-1.000000\"/>\r\n<tt:Scale x=\"0.002841\" y=\"0.003472\"/>\r\n</tt:Transformation>\r\n</tt:ElementItem>\r\n<tt:ElementItem Name=\"Field\"><tt:PolygonConfiguration><tt:Polygon><tt:Point x=\"0\" y=\"0\"/>\r\n<tt:Point x=\"0\" y=\"576\"/>\r\n<tt:Point x=\"704\" y=\"576\"/>\r\n<tt:Point x=\"704\" y=\"0\"/>\r\n</tt:Polygon>\r\n</tt:PolygonConfiguration>\r\n</tt:ElementItem>\r\n</tt:Parameters>\r\n</tan:AnalyticsModule>\r\n</tan:GetAnalyticsModulesResponse>\r\n</env:Body>\r\n</env:Envelope>\r\n",
      "headers": {
        "Date": "Tue, 23 Feb 2016 23:38:42 GMT",
        "Server": "App-webs/",
        "Connection": "close",
        "Content-Length": "4187",
        "Content-Type": "application/soap+xml; charset=utf-8"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
